app/Filament/Resources/SoalResource/Pages/Pertanyaan.php

insert into `pertanyaans` (`soal_id`, `teks_pertanyaan`, `jawaban`, `updated_at`, `created_at`) values (1, 'Apakah anda tahu bagaimana cara mengoperasikan komputer?', '1', '2024-05-25 11:46:23', '2024-05-25 11:46:23')
---
    public function create(): void
    {

        if($this->checkMaximumSoal()){
            Notification::make()
            ->title('Soal melebihi batas jumlah maksimal')
            ->danger()
            ->send();

            $this->resetForm();
           return;
        }

       $data = $this->form->getState();
       ModelPertanyaan::create($data);

select count(*) as aggregate from `pertanyaans` where `pertanyaans`.`soal_id` = 1 and `pertanyaans`.`soal_id` is not null
select * from `pertanyaans` where `pertanyaans`.`soal_id` = 1 and `pertanyaans`.`soal_id` is not null
---
    public function checkMaximumSoal(): bool{
        return $this->record->pertanyaans->count() >= $this->jumlah_soal;

delete from `pertanyaans` where `id` = 9
---
    public function hapusPertanyaan(ModelPertanyaan $pertanyaan) {
        $pertanyaan->delete();